# 16- splited a string into multiple columns

In [6]:
#import libraries
import pandas as pd
import numpy as np
import seaborn as sns

In [7]:
df = pd.DataFrame({"name": ['ahmed', 'saqib', 'walid','anas','waleed'],
'location':['LA, USA', 'Karachi, Pakistan', 'washanton,USA','lahore,USA', 'paris,London']})
df

     name           location
0   ahmed            LA, USA
1   saqib  Karachi, Pakistan
2   walid      washanton,USA
3    anas         lahore,USA
4  waleed       paris,London

In [8]:
df.location.str.split(",").head()

0              [LA,  USA]
1    [Karachi,  Pakistan]
2        [washanton, USA]
3           [lahore, USA]
4         [paris, London]
Name: location, dtype: object

In [13]:
# spliting column into two columns
df.location.str.split(",", expand=True)

           0          1
0         LA        USA
1    Karachi   Pakistan
2  washanton        USA
3     lahore        USA
4      paris     London

In [15]:
# adding splited columns in diffrent columns
df[["city", "country"]] = df.location.str.split(",", expand=True)
df

     name           location       city    country
0   ahmed            LA, USA         LA        USA
1   saqib  Karachi, Pakistan    Karachi   Pakistan
2   walid      washanton,USA  washanton        USA
3    anas         lahore,USA     lahore        USA
4  waleed       paris,London      paris     London

In [19]:
df = df[['name', 'city', 'country']]
df

     name       city    country
0   ahmed         LA        USA
1   saqib    Karachi   Pakistan
2   walid  washanton        USA
3    anas     lahore        USA
4  waleed      paris     London

# 17- aggregate by multiple groups/function

In [21]:
# import libraries
import pandas as pd
import numpy as np
import seaborn as sns

In [24]:
# import datasets
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
df.groupby('who').count()
df.groupby('sex').count()
# df.head()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

In [38]:
# df.groupby('who').sum() not support sum function
len(df.groupby('who'))

3

In [44]:
df.groupby(["sex", "adult_male", "pclass"]).count()
df.groupby(['sex', 'who', "embarked"]).count()

                       survived  pclass  age  sibsp  parch  fare  class  \
sex    who   embarked
female child C               13      13   13     13     13    13     13
             Q                1       1    1      1      1     1      1
             S               29      29   29     29     29    29     29
       woman C               60      60   48     60     60    60     60
             Q               35      35   11     35     35    35     35
             S              174     174  157    174    174   174    174
male   child C                5       5    5      5      5     5      5
             Q                4       4    4      4      4     4      4
             S               31      31   31     31     31    31     31
       man   C               90      90   64     90     90    90     90
             Q               37      37   12     37     37    37     37
             S              410     410  337    410    410   410    410

                       adult_male  deck  embark_town  alive  alone
sex    who   embarked
female child C                 13     0           13     13     13
             Q                  1     0            1      1      1
             S                 29     6           29     29     29
       woman C                 60    37           60     60     60
             Q                 35     2           35     35     35
             S                174    50          174    174    174
male   child C                  5     0            5      5      5
             Q                  4     0            4      4      4
             S                 31     7           31     31     31
       man   C                 90    32           90     90     90
             Q                 37     2           37     37     37
             S                410    65          410    410    410

# 18 - select specific rows and columns

In [46]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [48]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [52]:
df[['sex', 'class', 'deck']]

        sex   class deck
0      male   Third  NaN
1    female   First    C
2    female   Third  NaN
3    female   First    C
4      male   Third  NaN
..      ...     ...  ...
886    male  Second  NaN
887  female   First    B
888  female   Third  NaN
889    male   First    C
890    male   Third  NaN

[891 rows x 3 columns]

In [54]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [60]:
df.describe().loc[["min", '25%' , 'max']]

     survived  pclass     age  sibsp  parch      fare
min       0.0     1.0   0.420    0.0    0.0    0.0000
25%       0.0     2.0  20.125    0.0    0.0    7.9104
max       1.0     3.0  80.000    8.0    6.0  512.3292

In [66]:
df.describe().loc["min":'max']
df.describe().loc['min':'max', 'survived':'age']

     survived  pclass     age
min       0.0     1.0   0.420
25%       0.0     2.0  20.125
50%       0.0     3.0  28.000
75%       1.0     3.0  38.000
max       1.0     3.0  80.000

# 19- Reshape multiindex series

In [68]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [70]:
df.survived.mean()

0.3838383838383838

In [72]:
df.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [76]:
df.groupby(['sex','class']).survived.mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [81]:
df.groupby(['sex', 'class']).survived.mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 20- Continous to catogirical data conversion

In [83]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [85]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [94]:
pd.cut(df.age, bins = [0,18,25,99], labels=['child', 'young_adults', 'adult']).head()
df["new_age"] = pd.cut(df.age, bins = [1,18,25,99], labels=['child', 'young_adult', 'adult'])
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

# 21- convert one set of data into another

In [96]:
df.sex.head()

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

In [100]:
# convert to sex into numbe
df.sex.map({'male':0, 'female':1})
# feature engineering 
df['sex_num'] = df.sex.map({"male" : 0, "female":1})
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age,sex_num
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,0

In [107]:
df.embarked.count()
df.embarked.unique()
# df.embarked.factorize()[0]
df['embarked_num'] = df.embarked.factorize()[0]
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age,sex_num,embarked_num
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult,0,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,1,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,1,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,1,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,0,0

# 22- transpse a wide dataframe

In [109]:
import numpy as np
import pandas as pd

In [113]:
#create a new df
df = pd.DataFrame(np.random.rand(200,25), columns=list('abcdefghijklmnopqrstuvwxy'))
df.head()

,a,b,c,d,e,f,g,h,i,j,...,p,q,r,s,t,u,v,w,x,y
0,0.348087,0.840197,0.664583,0.398913,0.112152,0.087294,0.176501,0.133099,0.078906,0.364201,...,0.126834,0.444605,0.194563,0.145134,0.148839,0.307807,0.662988,0.132478,0.912319,0.892150
1,0.718664,0.299859,0.535967,0.368129,0.118554,0.294848,0.182795,0.200382,0.233498,0.439658,...,0.328259,0.590176,0.959675,0.396214,0.995804,0.052333,0.281686,0.599327,0.127184,0.782100
2,0.541893,0.188256,0.734147,0.918205,0.368319,0.428132,0.391741,0.542509,0.017893,0.794967,...,0.587754,0.039114,0.181850,0.722389,0.140343,0.245416,0.434149,0.520618,0.146676,0.523128
3,0.474057,0.642528,0.573256,0.647339,0.601019,0.050165,0.636247,0.528575,0.934331,0.816679,...,0.459577,0.075524,0.915135,0.697160,0.103091,0.622484,0.170399,0.872842,0.829882,0.440895
4,0.129095,0.186315,0.796263,0.913376,0.187665,0.912624,0.656942,0.185427,0.665176,0.778045,...,0.512905,0.227504,0.736418,0.700975,0.820577,0.000548,0.849799,0.338946,0.645538,0.597281

In [118]:
#transpose a column
df.head().T

          0         1         2         3         4
a  0.348087  0.718664  0.541893  0.474057  0.129095
b  0.840197  0.299859  0.188256  0.642528  0.186315
c  0.664583  0.535967  0.734147  0.573256  0.796263
d  0.398913  0.368129  0.918205  0.647339  0.913376
e  0.112152  0.118554  0.368319  0.601019  0.187665
f  0.087294  0.294848  0.428132  0.050165  0.912624
g  0.176501  0.182795  0.391741  0.636247  0.656942
h  0.133099  0.200382  0.542509  0.528575  0.185427
i  0.078906  0.233498  0.017893  0.934331  0.665176
j  0.364201  0.439658  0.794967  0.816679  0.778045
k  0.380605  0.727620  0.254251  0.861260  0.120358
l  0.508233  0.376076  0.509470  0.521033  0.558888
m  0.703588  0.389321  0.109417  0.096893  0.070660
n  0.442107  0.982354  0.710761  0.746937  0.444130
o  0.727212  0.739183  0.478780  0.840624  0.445072
p  0.126834  0.328259  0.587754  0.459577  0.512905
q  0.444605  0.590176  0.039114  0.075524  0.227504
r  0.194563  0.959675  0.181850  0.915135  0.736418
s  0.145134  0.396214  0.722389  0.697160  0.700975
t  0.148839  0.995804  0.140343  0.103091  0.820577
u  0.307807  0.052333  0.245416  0.622484  0.000548
v  0.662988  0.281686  0.434149  0.170399  0.849799
w  0.132478  0.599327  0.520618  0.872842  0.338946
x  0.912319  0.127184  0.146676  0.829882  0.645538
y  0.892150  0.782100  0.523128  0.440895  0.597281

In [120]:
df.describe().T

   count      mean       std       min       25%       50%       75%       max
a  200.0  0.465835  0.269141  0.004749  0.263035  0.432011  0.692937  0.978028
b  200.0  0.551544  0.287665  0.000856  0.329931  0.555269  0.812102  0.995765
c  200.0  0.496664  0.283689  0.000648  0.251818  0.509218  0.734319  0.993617
d  200.0  0.528467  0.284964  0.001863  0.284578  0.551918  0.781026  0.997932
e  200.0  0.475945  0.283754  0.004941  0.226075  0.455720  0.720815  0.999335
f  200.0  0.508041  0.297751  0.000593  0.238708  0.498463  0.779542  0.999892
g  200.0  0.483697  0.287313  0.007554  0.245109  0.460593  0.738667  0.996384
h  200.0  0.465762  0.274919  0.023611  0.237673  0.447230  0.665282  0.997266
i  200.0  0.498052  0.293206  0.003307  0.243886  0.496296  0.747005  0.987976
j  200.0  0.517786  0.293861  0.013433  0.277451  0.494020  0.786389  0.998162
k  200.0  0.508207  0.283226  0.003687  0.283135  0.498502  0.752106  0.996958
l  200.0  0.483843  0.280223  0.002823  0.252101  0.475692  0.710241  0.994266
m  200.0  0.505903  0.291292  0.000948  0.274873  0.513492  0.752216  0.994829
n  200.0  0.527385  0.286238  0.003582  0.289774  0.528876  0.773969  0.993782
o  200.0  0.492200  0.283171  0.001748  0.274949  0.518991  0.724150  0.990459
p  200.0  0.466189  0.284803  0.002073  0.227306  0.453426  0.716631  0.995205
q  200.0  0.499002  0.299329  0.003213  0.226375  0.498985  0.767133  0.993980
r  200.0  0.489529  0.299942  0.002226  0.232455  0.493333  0.754431  0.986767
s  200.0  0.495307  0.280573  0.001090  0.275600  0.494108  0.723751  0.988572
t  200.0  0.514960  0.281242  0.007955  0.262459  0.544930  0.750273  0.998289
u  200.0  0.467400  0.282307  0.000548  0.224001  0.442042  0.697359  0.992856
v  200.0  0.454481  0.289549  0.000942  0.221122  0.432620  0.690907  0.998056
w  200.0  0.501359  0.307299  0.001492  0.217377  0.523515  0.787436  0.999146
x  200.0  0.519484  0.277925  0.006130  0.299035  0.525598  0.758375  0.992806
y  200.0  0.492166  0.287390  0.002194  0.275474  0.478228  0.744414  0.997006

# 23- Reshaping a dataframe

In [ ]:
fasla = pd.DataFrame([['12345', 100,200,300], ['34567', 400,500,600]])